app/Controllers/DevisController.php

    public function index(){
        $data['devis'] = $this->devis->findall();
---
SELECT *
FROM `devis`
WHERE `devis`.`deleted_at` IS NULL