app/Controllers/ServiceController.php

SELECT *
FROM `services`
WHERE `services`.`deleted_at` IS NULL
---
    public function index()
    {
        $service = new ServiceModel();
        $data['services'] = $service->findall();

INSERT INTO `services` (`nom`, `desc`, `prix_unitaire`, `created_at`, `updated_at`) VALUES ('Support Premium 24*7', '', 4000, '2023-05-25 14:22:17', '2023-05-25 14:22:17')
---
    public function insert_service(){
        $data = $this->request->getJSON();
        $this->response->setJSON([
            'message' => $data
        ]);
        // Create a new Devis model instance and insert the data
        $this->service->insert($data);

UPDATE `services` SET `nom` = 'vCPU', `desc` = 'par 1Gb', `prix_unitaire` = 300, `updated_at` = '2023-05-25 14:24:09'
WHERE `services`.`id` IN ('4')
---
    public function store(){
        $data = $this->request->getJSON();
        $this->service->save($data);