app/Controllers/UtilisateurController.php

    public function login()
    {
        $data = $this->request->getJSON();

        // Authenticate the user
        $user = $this->utilisateur->where('email', $data->email)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `email` = 'johndoe@example.com'
AND `utilisateurs`.`deleted_at` IS NULL
 LIMIT 1

    public function profile()
    {
        $data['utilisateurs'] = $this->utilisateur->findall();
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`deleted_at` IS NULL